In [74]:
import pandas as pd
from pathlib import Path

pd.options.display.max_colwidth = 600  # Set Full Display

# Import Data and Contact DataFrame: df_combined

### Read Part I:

In [75]:
# use r -- to avoid unicode error !
file_path1=Path(r'C:\Users\LEON\test\domain\address_data.csv')
df1 = pd.read_csv(file_path1)
print(df1.info())
df1.sample(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 219063 entries, 0 to 219062
Data columns (total 7 columns):
flat_number         73498 non-null object
number_first        219063 non-null object
number_last         18020 non-null object
street_name         219063 non-null object
street_type_code    217784 non-null object
locality_name       219063 non-null object
postcode            219063 non-null int64
dtypes: int64(1), object(6)
memory usage: 11.7+ MB
None

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
26391,NaN,33,NaN,THE RIDGE,NaN,BLACKBURN,3130

In [76]:
df1.index

RangeIndex(start=0, stop=219063, step=1)

In [77]:
df1.reset_index(drop=True)

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
0,NaN,166,NaN,DONCASTER,ROAD,BALWYN NORTH,3104
1,NaN,17,NaN,OSBURN,AVENUE,BALWYN NORTH,3104
2,NaN,23,NaN,PANORAMIC,ROAD,BALWYN NORTH,3104
3,NaN,4,NaN,PANORAMIC,ROAD,BALWYN NORTH,3104
4,NaN,10,NaN,ROBERT,STREET,BALWYN NORTH,3104
...,...,...,...,...,...,...,...
219058,NaN,35,NaN,CARROL,GROVE,MOUNT WAVERLEY,3149
219059,NaN,17,NaN,HIGHCLERE,AVENUE,MOUNT WAVERLEY,3149
219060,NaN,11,NaN,BOND,STREET,MOUNT WAVERLEY,3149
219061,NaN,1,NaN,CURTIS,AVENUE,MOUNT WAVERLEY,3149
219062,49,110,NaN,KING,STREET,DONCASTER EAST,3109

In [78]:
df1.index

RangeIndex(start=0, stop=219063, step=1)

### Read Part II:

非常注意：一定要rename,不然出现14个而不是7个列

In [79]:
# use r -- to avoid unicode error !
file_path2=Path(r'C:\Users\LEON\test\domain\address_data_2.csv')
df2 = pd.read_csv(file_path2,header=None)
df2.columns = ["flat_number","number_first","number_last","street_name","street_type_code","locality_name","postcode"]
print(df2.info())
df2.sample(1)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46340 entries, 0 to 46339
Data columns (total 7 columns):
flat_number         19545 non-null object
number_first        46339 non-null object
number_last         4187 non-null object
street_name         46340 non-null object
street_type_code    46127 non-null object
locality_name       46340 non-null object
postcode            46340 non-null int64
dtypes: int64(1), object(6)
memory usage: 2.5+ MB
None

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
41110,3,14,NaN,OAKES,AVENUE,CLAYTON SOUTH,3169

## Concat DataFrame:

In [80]:
df1_2=pd.concat([df1,df2])
df_combined=df1_2.reset_index(drop=True)
display(df_combined.head(3))
display(df_combined.tail(3))

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
0,NaN,166,NaN,DONCASTER,ROAD,BALWYN NORTH,3104
1,NaN,17,NaN,OSBURN,AVENUE,BALWYN NORTH,3104
2,NaN,23,NaN,PANORAMIC,ROAD,BALWYN NORTH,3104

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
265400,NaN,85,NaN,BLACKBURN,ROAD,DONCASTER EAST,3109
265401,NaN,24,NaN,HIGHLAND,BOULEVARD,RINGWOOD,3134
265402,NaN,9,NaN,RESERVE,AVENUE,MITCHAM,3132

# Check Data Quality:

## Check Null:

In [81]:
print(df_combined.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265403 entries, 0 to 265402
Data columns (total 7 columns):
flat_number         93043 non-null object
number_first        265402 non-null object
number_last         22207 non-null object
street_name         265403 non-null object
street_type_code    263911 non-null object
locality_name       265403 non-null object
postcode            265403 non-null int64
dtypes: int64(1), object(6)
memory usage: 14.2+ MB
None

PS: flat number, number first / last -- ie 3/100-105 xxx st

PS: 注意，st_name = locality_name (surburb),但是 不等于 street_type_code !!

In [82]:
df_combined["street_type_code"].isnull().sum()

1492

In [83]:
df_combined=df_combined.fillna("")

In [84]:
print(df_combined.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265403 entries, 0 to 265402
Data columns (total 7 columns):
flat_number         265403 non-null object
number_first        265403 non-null object
number_last         265403 non-null object
street_name         265403 non-null object
street_type_code    265403 non-null object
locality_name       265403 non-null object
postcode            265403 non-null int64
dtypes: int64(1), object(6)
memory usage: 14.2+ MB
None

## Check Duplicates I:

In [85]:
df_combined.duplicated().sum()

800

In [86]:
df_combined[df_combined.duplicated()].sample(4)

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
138137,64,175,,MAROONDAH,HIGHWAY,RINGWOOD,3134
251483,,230A,,BLACKBURN,ROAD,GLEN WAVERLEY,3150
138861,4,12,,MAROONDAH,HIGHWAY,RINGWOOD,3134
223421,5,315,319,HUNTINGDALE,ROAD,CHADSTONE,3148

## Check Data Type and Regex:

### 1. Check Number:

property_search_url = "https://api2.aupropertyreport.com/api/property/search?q=15+15A+Ian+Grove+Burwood+vic+3125"

In [87]:
df_combined['flat_number'].str.contains('\D').sum()

3930

In [88]:
df_combined[df_combined['flat_number'].str.contains('\D')].sample(2)

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
142590,G6,5,7,DIXON,STREET,CLAYTON,3168
153347,312A,399,,BURWOOD,HIGHWAY,BURWOOD,3125

非常注意：24A/227-235 Springvale Road, Glen Waverley VIC 3150 是 Commercial !!

In [89]:
df_combined['number_first'].str.contains('\D').sum()

11571

In [90]:
df_combined[df_combined['number_first'].str.contains('\D')].sample(2)

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
95130,,574B,,WHITEHORSE,ROAD,MITCHAM,3132
162496,308,1B,,NELSON,STREET,RINGWOOD,3134

In [91]:
df_combined['number_last'].str.contains('\D').sum()

146

In [92]:
df_combined[df_combined['number_last'].str.contains('\D')].sample(2)

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode
129633,,14A,14B,METROPOLITAN,AVENUE,NUNAWADING,3131
253223,,1,1A,BANOOL,ROAD,SURREY HILLS,3127

### 2. Check Wrong Character: Regex

In [93]:
df_combined['street_name'].str.contains(r'\(\D+\）|\（\D+\)|\(\D+\)|\（\D+\）|\*|\。|\||\【|\】|\[|\]|\<\S+>|\*\d+\*|[\u4e00-\u9fff]').sum()

0

In [94]:
df_combined['street_type_code'].str.contains(r'\(\D+\）|\（\D+\)|\(\D+\)|\（\D+\）|\*|\。|\||\【|\】|\[|\]|\<\S+>|\*\d+\*|[\u4e00-\u9fff]').sum()

0

In [95]:
df_combined['locality_name'].str.contains(r'\(\D+\）|\（\D+\)|\(\D+\)|\（\D+\）|\*|\。|\||\【|\】|\[|\]|\<\S+>|\*\d+\*|[\u4e00-\u9fff]').sum()

0

非常注意， int 没有 .str method, 需要先转换成 Str!

In [96]:
df_combined['postcode'] = df_combined['postcode'].astype("str")

In [97]:
df_combined['postcode'].str.contains('\D').sum()

0

### Summary:

1. Duplicates 需要把地址 拼接在一起 再检查

2. 地址 前三列，错位情况，含字母， 需要拼接在一起

3. 部分，可能内含 两个 空格， 需要改成一个！！

4. 把 空格 替换成 + 号 才能 API search

5. 非常注意： 15-15A Ian GroveBurwood VIC 3125 缺少空格！！！！

6. 非常注意：有些地址是 Commercial, search result OR history 是空的 List ！！！！

# Concat Columns: to full address

In [98]:
df_combined['address'] = df_combined['flat_number']+' '+\
    df_combined['number_first']+' '+\
        df_combined['number_last']+' '+\
            df_combined['street_name']+' '+\
                    df_combined['street_type_code']+' '+\
                        df_combined['locality_name']+' '+\
                            df_combined['postcode']

In [99]:
df_combined['address'].head()

0     166  DONCASTER ROAD BALWYN NORTH 3104
1       17  OSBURN AVENUE BALWYN NORTH 3104
2      23  PANORAMIC ROAD BALWYN NORTH 3104
3       4  PANORAMIC ROAD BALWYN NORTH 3104
4       10  ROBERT STREET BALWYN NORTH 3104
Name: address, dtype: object

# Check & Clean Extra Space:

In [100]:
df_combined['address'].str.contains("  ").sum()

243323

In [101]:
df_combined['address']=df_combined['address'].str.replace("  ", " ")

In [102]:
df_combined['address'].str.contains("  ").sum()

1

In [103]:
df_combined[df_combined['address'].str.contains("  ")]

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode,address
221640,1,,,CARINISH,ROAD,CLAYTON,3168,1 CARINISH ROAD CLAYTON 3168

In [104]:
df_combined.iloc[246519,7]

' 46 ERICA AVENUE GLEN IRIS 3146'

In [105]:
df_combined.loc[df_combined.index[246519],"address"]

' 46 ERICA AVENUE GLEN IRIS 3146'

In [106]:
# Select Single Column:
# df_combined.loc[:,[False,False,False,False,False,False,False,True]]

PS: 还没有 remove 干净，所以再 remove 一次 space!

In [107]:

df_combined['address']=df_combined['address'].str.replace("  ", " ")

In [108]:
df_combined['address'].str.contains("  ").sum()

0

# Check Duplicate II: df_combined2

In [109]:
df_combined.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 265403 entries, 0 to 265402
Data columns (total 8 columns):
flat_number         265403 non-null object
number_first        265403 non-null object
number_last         265403 non-null object
street_name         265403 non-null object
street_type_code    265403 non-null object
locality_name       265403 non-null object
postcode            265403 non-null object
address             265403 non-null object
dtypes: object(8)
memory usage: 16.2+ MB

In [110]:
# df_combined['address'].sort_values()

In [111]:
df_combined[df_combined['address']==" 1 MIDWAY ARCADE RINGWOOD 3134"]

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode,address
222343,,1,,MIDWAY,ARCADE,RINGWOOD,3134,1 MIDWAY ARCADE RINGWOOD 3134
241737,,1,,MIDWAY,ARCADE,RINGWOOD,3134,1 MIDWAY ARCADE RINGWOOD 3134

In [112]:
df_combined['address'].duplicated().sum()

800

OR:

In [113]:
df_combined.duplicated(subset="address").sum()

800

In [114]:
df_combined[df_combined['address'].duplicated()].count()

flat_number         800
number_first        800
number_last         800
street_name         800
street_type_code    800
locality_name       800
postcode            800
address             800
dtype: int64

In [115]:
df_combined[df_combined['address'].duplicated(keep=False)].count()

flat_number         1474
number_first        1474
number_last         1474
street_name         1474
street_type_code    1474
locality_name       1474
postcode            1474
address             1474
dtype: int64

非常注意，keep = False, 意思是 所有重复的都算，default = First  第一次出现的不算。

In [116]:
df_combined2 = df_combined.drop_duplicates(subset="address")

In [117]:
df_combined2[df_combined2['address'].duplicated(keep=False)].count()

flat_number         0
number_first        0
number_last         0
street_name         0
street_type_code    0
locality_name       0
postcode            0
address             0
dtype: int64

# Clean, 部分data 第一个数字之前，还有 SPACE

Check First:

PS: 如果 第一个 character 是 space, 那么就 replace with ""

In [118]:
df_combined2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 264603 entries, 0 to 265402
Data columns (total 8 columns):
flat_number         264603 non-null object
number_first        264603 non-null object
number_last         264603 non-null object
street_name         264603 non-null object
street_type_code    264603 non-null object
locality_name       264603 non-null object
postcode            264603 non-null object
address             264603 non-null object
dtypes: object(8)
memory usage: 18.2+ MB

In [119]:
(df_combined2["address"].str[0]==" ").sum()

172033

In [120]:
df_combined2.loc[df_combined2["address"].str[0]==" ","address"].sample(2)

74284     42 BALLANTYNE STREET BURWOOD EAST 3151
75397          12 MAITLAND STREET GLEN IRIS 3146
Name: address, dtype: object

Clean it:

非常注意： 这是个 ERROR 错误！ 等于把 address 替换成 ""  而"" 不是 None ！！

In [121]:
# df_combined2.loc[df_combined2["address"].str[0]==" ","address"]=""

In [122]:
df_combined2.loc[df_combined2["address"].str[0]==" ","address"]

0           166 DONCASTER ROAD BALWYN NORTH 3104
1             17 OSBURN AVENUE BALWYN NORTH 3104
2            23 PANORAMIC ROAD BALWYN NORTH 3104
3             4 PANORAMIC ROAD BALWYN NORTH 3104
4             10 ROBERT STREET BALWYN NORTH 3104
                           ...
265396     11 MANNERING DRIVE GLEN WAVERLEY 3150
265399             2 PURCHES STREET MITCHAM 3132
265400     85 BLACKBURN ROAD DONCASTER EAST 3109
265401       24 HIGHLAND BOULEVARD RINGWOOD 3134
265402             9 RESERVE AVENUE MITCHAM 3132
Name: address, Length: 172033, dtype: object

In [123]:
# type(df_combined2.loc[df_combined2["address"].str[0]==" ","address"])

In [124]:
# ERROR 只能找到 这个 series 的第一个：
df_combined2.loc[df_combined2["address"].str[0]==" ","address"][0]

' 166 DONCASTER ROAD BALWYN NORTH 3104'

In [125]:
# ERROR! AttributeError: 'str' object has no attribute 'str'
# df_combined2.loc[df_combined2["address"].str[0]==" ","address".str[0]]

In [144]:
df_combined2["address"]=df_combined2["address"].str.replace("^ ","")

C:\Users\LEON\anaconda3\envs\quantenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

Check Again:

In [127]:
(df_combined2["address"].str[0]==" ").sum()

0

In [128]:
df_combined2[df_combined2["address"].str[0]==" "]

Empty DataFrame
Columns: [flat_number, number_first, number_last, street_name, street_type_code, locality_name, postcode, address]
Index: []

In [129]:
df_combined2.sample(2)

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode,address
122876,,65,,BOND,STREET,RINGWOOD,3134,65 BOND STREET RINGWOOD 3134
114189,,129B,,WESTALL,ROAD,CLAYTON SOUTH,3169,129B WESTALL ROAD CLAYTON SOUTH 3169

# Split into Different Surburbs:

## List of types:

In [137]:
list_types=df_combined2["street_type_code"].unique()
list_types

array(['ROAD', 'AVENUE', 'STREET', 'PLACE', 'GROVE', 'DRIVE', 'COURT', '',
       'PARADE', 'CLOSE', 'WAY', 'BOULEVARD', 'CRESCENT', 'LANE',
       'HIGHWAY', 'TERRACE', 'CIRCUIT', 'RISE', 'QUADRANT', 'WYND',
       'CREST', 'MEWS', 'WALK', 'SQUARE', 'CHASE', 'MALL', 'VIEW',
       'RIDGE', 'CIRCLE', 'COVE', 'GARDENS', 'EDGE', 'BEND', 'REACH',
       'RETREAT', 'VIEWS', 'BYPASS', 'ROW', 'NOOK', 'HEATH', 'ARCADE',
       'FREEWAY'], dtype=object)

In [138]:
len(list_types)

42

## List of Surburbs:

In [131]:
list_sub=df_combined2["locality_name"].unique()
list_sub

array(['BALWYN NORTH', 'BOX HILL SOUTH', 'CLAYTON', 'MITCHAM',
       'DONCASTER EAST', 'BOX HILL', 'GLEN WAVERLEY', 'CAMBERWELL',
       'BURWOOD EAST', 'OAKLEIGH', 'BLACKBURN', 'BLACKBURN SOUTH',
       'BALWYN', 'CLAYTON SOUTH', 'NUNAWADING', 'MULGRAVE', 'CHADSTONE',
       'BURWOOD', 'ASHWOOD', 'NOTTING HILL', 'HUNTINGDALE',
       'MOUNT WAVERLEY', 'VERMONT SOUTH', 'RINGWOOD', 'FOREST HILL',
       'DONCASTER', 'GLEN IRIS', 'OAKLEIGH EAST', 'MONT ALBERT',
       'WHEELERS HILL', 'VERMONT', 'SURREY HILLS', 'TEMPLESTOWE'],
      dtype=object)

In [132]:
len(list_sub)

33

In [133]:
list_sub.sort()
list_sub

array(['ASHWOOD', 'BALWYN', 'BALWYN NORTH', 'BLACKBURN',
       'BLACKBURN SOUTH', 'BOX HILL', 'BOX HILL SOUTH', 'BURWOOD',
       'BURWOOD EAST', 'CAMBERWELL', 'CHADSTONE', 'CLAYTON',
       'CLAYTON SOUTH', 'DONCASTER', 'DONCASTER EAST', 'FOREST HILL',
       'GLEN IRIS', 'GLEN WAVERLEY', 'HUNTINGDALE', 'MITCHAM',
       'MONT ALBERT', 'MOUNT WAVERLEY', 'MULGRAVE', 'NOTTING HILL',
       'NUNAWADING', 'OAKLEIGH', 'OAKLEIGH EAST', 'RINGWOOD',
       'SURREY HILLS', 'TEMPLESTOWE', 'VERMONT', 'VERMONT SOUTH',
       'WHEELERS HILL'], dtype=object)

# Clean: Crescent to Cres

In [159]:
df_combined2["address"]=df_combined2["address"].str.replace("CRESCENT","Cres")

C:\Users\LEON\anaconda3\envs\quantenv\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

## Slicing to Target Suburb: df_target

In [160]:
target='GLEN WAVERLEY'
df_target=df_combined2[df_combined2["locality_name"]==target]

# To Excel:

In [161]:
df_target.info()
df_target.sample(2)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19478 entries, 32 to 265396
Data columns (total 8 columns):
flat_number         19478 non-null object
number_first        19478 non-null object
number_last         19478 non-null object
street_name         19478 non-null object
street_type_code    19478 non-null object
locality_name       19478 non-null object
postcode            19478 non-null object
address             19478 non-null object
dtypes: object(8)
memory usage: 1.3+ MB

,flat_number,number_first,number_last,street_name,street_type_code,locality_name,postcode,address
75475,,43,,KENNEDY,STREET,GLEN WAVERLEY,3150,43 KENNEDY STREET GLEN WAVERLEY 3150
176627,91,37,47,VIEW MOUNT,ROAD,GLEN WAVERLEY,3150,91 37 47 VIEW MOUNT ROAD GLEN WAVERLEY 3150

PS: Including Commercial

VS. address_count = 14095 from Auproperty Report

In [162]:
# create excel writer object
writer=pd.ExcelWriter(f'address of {target}.xlsx')
# write dataframe to excel
df_target.to_excel(writer, index=False)
# save the excel
writer.save()
print('DataFrame is written successfully to Excel File.')

DataFrame is written successfully to Excel File.

# Summary:
1. Address Includes Commercial

2. Duplicates Found 

df_combined[df_combined['address'].duplicated(keep=False)].count()  --- find ALL, default = find the first duplicated one.

3. Repalce first character

df_combined2.loc[df_combined2["address"].str[0]==" ","address"][0]

df_combined2["address"]=df_combined2["address"].str.replace("^ ","")